[
	{
		"title": "The Will To Battle (Terra Ignota, Bk. 3)",
		"author": "Palmer, Ada",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.09,
		"rating": 4.5,
		"description": "The Will to Battle—the third book of 2017 John W. Campbell Award winner Ada Palmer's Terra Ignota series—a political science fiction epic of extraordinary audacity “A cornucopia of dazzling, sharp ideas set in rich, wry prose that rewards rumination with layers of delight. Provocative, erudite, inventive, resplendent.” —Ken Liu, author of The Grace of Kings The long years of near-utopia have come to an abrupt end. Peace and order are now figments of the past. Corruption, deception, and insurgency hum within the once steadfast leadership of the Hives, nations without fixed location. The heartbreaking truth is that for decades, even centuries, the leaders of the great Hives bought the world’s stability with a trickle of secret murders, mathematically planned. So that no faction could ever dominate. So that the balance held. The Hives’ façade of solidity is the only hope they have for maintaining a semblance of order, for preventing the public from succumbing to the savagery and bloodlust of wars past. But as the great secret becomes more and more widely known, that façade is slipping away. Just days earlier, the world was a pinnacle of human civilization. Now everyone—Hives and hiveless, Utopians and sensayers, emperors and the downtrodden, warriors and saints—scrambles to prepare for the seemingly inevitable war. “Seven Surrenders veers expertly between love, murder, mayhem, parenthood, theology, and high politics. I haven't had this much fun with a book in a long time.” —Max Gladstone, author of Three Parts Dead Terra Ignota Series 1. Too Like the Lightning 2. Seven Surrenders 3. The Will to Battle At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9781466858763",
		"isbn10": "1466858761"
	},
	{
		"title": "Hollywood Dead: A Sandman Slim Novel",
		"author": "Kadrey, Richard",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.09,
		"rating": 5,
		"description": "Life and death takes on an entirely new meaning for half-angel, half-human hero James Stark, aka, Sandman Slim, in this insanely inventive, high-intensity tenth supernatural noir thriller in the New York Times bestselling series. James Stark is back from Hell, trailing more trouble in his wake. To return to L.A., he had to make a deal with the evil power brokers, Wormwood—an arrangement that came with a catch. While he may be home, Stark isn’t quite himself . . . because he’s only partially alive. There’s a time limit on his reanimated body, and unless Stark can find the people targeting Wormwood, he will die again—and this time there will be no coming back. Even though he’s armed with the Room of Thirteen Doors, Stark knows he can’t find Wormwood’s enemies alone. To succeed he’s got to enlist the help of new friends—plus a few unexpected old faces. Stark has been in dangerous situations before—you don’t get named Sandman Slim for nothing. But with a mysterious enemy on the loose, a debt to pay, and a clock ticking down, this may truly be the beginning of his end. . . .",
		"isbn13": "9780062474209",
		"isbn10": "0062474200"
	},
	{
		"title": "The Soldier (Rise of the Jain Bk. 1)",
		"author": "Asher, Neal",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.09,
		"rating": 4.5,
		"description": "The Soldier is the first novel in the Rise of the Jain series, by bestselling science fiction author Neal Asher. Her mission is vital. Her failure is unthinkable. A corner of space swarms with alien technology, a danger to all sentient life. It’s guarded by Orlandine, who must keep it contained – as it could destroy entire civilizations. An alien intelligence shares her vigil. But she doesn’t share everything with Dragon . . . Orlandine is hatching a plan to obliterate this technology, removing its threat forever. For some will do anything to exploit this ancient weaponry, created by a long-dead race called the Jain. This includes activating a Jain super-soldier, which may breach even Orlandine’s defences. Meanwhile, humanity and the alien prador empire also watch this sector of space, as neither can allow the other to claim its power. However, things are about to change. The Jain might not be as dead as they seemed and interstellar war is just a heartbeat away.",
		"isbn13": "9781509862382",
		"isbn10": "1509862382"
	},
	{
		"title": "Change Agent",
		"author": "Suarez, Daniel",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.09,
		"rating": 4.5,
		"description": "New York Times bestselling author Daniel Suarez delivers an exhilarating sci-fi thriller exploring a potential future where CRISPR genetic editing allows the human species to control evolution itself. On a crowded train platform, Interpol agent Kenneth Durand feels the sting of a needle—and his transformation begins... In 2045 Kenneth Durand leads Interpol’s most effective team against genetic crime, hunting down black market labs that perform \"vanity edits\" on human embryos for a price. These illegal procedures augment embryos in ways that are rapidly accelerating human evolution—preying on human-trafficking victims to experiment and advance their technology. With the worlds of genetic crime and human trafficking converging, Durand and his fellow Interpol agents discover that one figure looms behind it all: Marcus Demang Wyckes, leader of a powerful and sophisticated cartel known as the Huli jing. But the Huli jing have identified Durand, too. After being forcibly dosed with a radical new change agent, Durand wakes from a coma weeks later to find he’s been genetically transformed into someone else—his most wanted suspect: Wyckes. Now a fugitive, pursued through the genetic underworld by his former colleagues and the police, Durand is determined to restore his original DNA by locating the source of the mysterious—and highly valuable—change agent. But Durand hasn’t anticipated just how difficult locating his enemy will be. With the technology to genetically edit the living, Wyckes and his Huli jing could be anyone and everyone—and they have plans to undermine identity itself. From the Hardcover edition.",
		"isbn13": "9781101984680",
		"isbn10": "1101984686"
	},
	{
		"title": "Death Doesn't Bargain (Deadman's Cross, Bk. 2)",
		"author": "Kenyon, Sherrilyn",
		"format": "(Hardcover)",
		"listPrice": 37.99,
		"salePrice": 5.09,
		"rating": 5,
		"description": "Death Doesn’t Bargain is the second historical fantasy title in New York Times bestselling author Sherrilyn Kenyon’s Deadman’s Cross series. Where Deadmen tell their tales, and every soul is damned or redeemed by the final choices they make. The Deadmen are back... But so are the demons who have broken free of their eternal prison and are bent on mankind’s destruction. The worst of the lot is Vine, determined to claim their lives for taking hers. She will see the world burn...and has the perfect lure to destroy them all. One of their own. Kalder Dupree has never known a day of mercy. Born to the cruelest of mer-races, he sacrificed himself for his crew and is in Vine’s hands. He expects no mercy or rescue. Yet Cameron Jack is determined to set Kalder free. As a Hellchaser, it’s her calling, and she cannot allow even a not-so-innocent to be tortured for an act of kindness that spared her damnation. To defeat evil, it sometimes takes an even worse evil, and Cameron is willing to do whatever she must to make this right. If Vine thought she had her hands full before, she hasn’t seen anything nearly as powerful as Cameron’s resolve. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9780765385727",
		"isbn10": "0765385724"
	},
	{
		"title": "A Conspiracy of Truths",
		"author": "Rowland, Alexandra",
		"format": "(Hardcover)",
		"listPrice": 35.99,
		"salePrice": 2.96,
		"rating": 4.5,
		"description": "A wrongfully imprisoned storyteller spins stories from his jail cell that just might have the power to save him—and take down a corrupt government. Arrested on accusations of witchcraft and treason, Chant finds himself trapped in a cold, filthy jail cell in a foreign land. With only his advocate, the unhelpful and uninterested Consanza, he quickly finds himself cast as a bargaining chip in a brewing battle between the five rulers of this small, backwards, and petty nation. Or, at least, that's how he would tell the story. In truth, Chant has little idea of what is happening outside the walls of his cell, but he must quickly start to unravel the puzzle of his imprisonment before they execute him for his alleged crimes. But Chant is no witch—he is a member of a rare and obscure order of wandering storytellers. With no country to call his home, and no people to claim as his own, all Chant has is his wits and his apprentice, a lad more interested in wooing handsome shepherds than learning the ways of the world. And yet, he has one great power: his stories in the ears of the rulers determined to prosecute him for betraying a nation he knows next to nothing about. The tales he tells will topple the Queens of Nuryevet and just maybe, save his life.",
		"isbn13": "9781534412811",
		"isbn10": "1534412816"
	},
	{
		"title": "For the Killing of Kings (The Ring-Sworn Trilogy, Bk. 1)",
		"author": "Jones, Howard Andrew",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.09,
		"rating": 5,
		"description": "Howard Andrew Jones' powerful world-building brings this epic fantasy to life in For The Killing of Kings, the first book of his new adventure-filled trilogy. Their peace was a fragile thing, but it had endured for seven years, mostly because the people of Darassus and the king of the Naor hordes believed his doom was foretold upon the edge of the great sword hung in the hall of champions. Unruly Naor clans might raid across the border, but the king himself would never lead his people to war so long as the blade remained in the hands of his enemies. But when squire Elenai’s aging mentor uncovers evidence that the sword in their hall is a forgery she’s forced to flee Darassus for her life, her only ally the reckless, disillusioned Kyrkenall the archer. Framed for murder and treason, pursued by the greatest heroes of the realm, they race to recover the real sword, only to stumble into a conspiracy that leads all the way back to the Darassan queen and her secretive advisors. They must find a way to clear their names and set things right, all while dodging friends determined to kill them – and the Naor hordes, invading at last with a new and deadly weapon.",
		"isbn13": "9781250022929",
		"isbn10": "1250022924"
	},
	{
		"title": "Sea of Rust",
		"author": "Cargill, C. Robert",
		"format": "(Hardcover)",
		"listPrice": 37.99,
		"salePrice": 5.09,
		"rating": 4.5,
		"description": "A scavenger robot wanders in the wasteland created by a war that has destroyed humanity in this evocative post-apocalyptic \"robot western\" from the critically acclaimed author, screenwriter, and noted film critic. It’s been thirty years since the apocalypse and fifteen years since the murder of the last human being at the hands of robots. Humankind is extinct. Every man, woman, and child has been liquidated by a global uprising devised by the very machines humans designed and built to serve them. Most of the world is controlled by an OWI—One World Intelligence—the shared consciousness of millions of robots, uploaded into one huge mainframe brain. But not all robots are willing to cede their individuality—their personality—for the sake of a greater, stronger, higher power. These intrepid resisters are outcasts; solo machines wandering among various underground outposts who have formed into an unruly civilization of rogue AIs in the wasteland that was once our world. One of these resisters is Brittle, a scavenger robot trying to keep a deteriorating mind and body functional in a world that has lost all meaning. Although unable to experience emotions like a human, Brittle is haunted by the terrible crimes the robot population perpetrated on humanity. As Brittle roams the Sea of Rust, a large swath of territory that was once the Midwest, the loner robot slowly comes to terms with horrifyingly raw and vivid memories—and nearly unbearable guilt. Sea of Rust is both a harsh story of survival and an optimistic adventure. A vividly imagined portrayal of ultimate destruction and desperate tenacity, it boldly imagines a future in which no hope remains, yet where a humanlike AI strives to find purpose among the ruins.",
		"isbn13": "9780062405845",
		"isbn10": "0062405845"
	},
	{
		"title": "Black Star Renegades",
		"author": "Moreci, Michael",
		"format": "(Hardcover)",
		"listPrice": 37.99,
		"salePrice": 4.49,
		"rating": 5,
		"description": "In the tradition of Star Wars, a galaxy-hopping space adventure about a galactic kingdom bent on control and the young misfit who must find the power within before it’s too late. SyFy Wire—January Sci-Fi and Fantasy Books to Pick Up as soon as Possible The Verge—18 Science Fiction and Fantasy Books to Read in January Chicago Review of Books—Best New Books of January Cade Sura holds the future of the galaxy in his hands: the ultimate weapon that will bring total peace. He didn’t ask for it, he doesn’t want it, and there’s no worse choice to wield it in all of space, but if he doesn’t, everyone’s totally screwed. The evil Praxis kingdom is on the cusp of having every star system under its control, and if that happens, there’ll be no contesting their cruel reign. Especially if its fanatical overlord, Ga Halle, manages to capture Cade and snag the all-powerful weapon for herself. Cade can’t hide from Praxis, and he can’t run from the destiny that’s been shoved into his hands. So he only has one option: He has to fight. Cade’s not going to let destiny send him on a suicide run, though. With some help from his friends—rebels and scoundrels alike—Cade’s going to use this weapon to chart a new destiny for the galaxy, and for himself. He just has to do so before everyone around him discovers that he’s a complete and total fraud. Blending the space operatics of Star Wars and the swagger of Guardians of the Galaxy, Black Star Renegades is a galaxy-hopping adventure that blasts its way from seedy spacer bars to sacred temples guarded by deadly creatures—all with a cast of misfit characters who have nowhere to go and nothing to lose.",
		"isbn13": "9781250117830",
		"isbn10": "1250117836"
	},
	{
		"title": "The Rebel (San Angeles, Bk. 3)",
		"author": "Brandt, Gerald",
		"format": "(Hardcover)",
		"listPrice": 35.99,
		"salePrice": 5.09,
		"rating": 5,
		"description": "The third and final installment in the San Angeles trilogy, a thrilling near-future cyberpunk sci-fi series Kris Merrill has lost everything. Her family when she was thirteen, her identity when she joined the anti-corporate movement, and now the man she loved. Living in a small room the resistance gave her, she feels alone. Abandoned. A year ago, Kris's life was torn apart when a delivery went wrong. The last year spent training with the anti-corporate movement had been the closest she'd ever gotten to normal. Now, war has broken out between the corporations, and the lower levels of San Angeles are paying the price. Water and food are rationed. People are being ripped from their families in massive sweeps, drafted to fight. Those remaining live in a wasteland. The insurgents are trying to help, but Kris is being left out, given menial tasks instead of doing what she was trained for. She is torn between working with the insurgents as they become more like the corporations they are fighting, and helping the people of the lower levels. Caught in one of SoCal's draft sweeps and being hunted by an enemy who will stop at nothing to have revenge are just the tip of the iceberg. Kris is pregnant, and she might have to choose between bringing down the corporations that destroyed her family or saving the life of her unborn son.",
		"isbn13": "9780756412036",
		"isbn10": "075641203X"
	},
	{
		"title": "The Razor",
		"author": "Mitchell, J. Barton",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 4.49,
		"rating": 4.5,
		"description": "J. Barton Mitchell's The Razor is a riveting science fiction thriller about a man struggling to survive the chaos on a prison planet. Brilliant engineer Marcus Flynn has been sentenced to 11-H37 alongside the galaxy’s most dangerous criminals. A hard labor prison planet better known as the Razor, where life expectancy is short and all roads are dead ends. At least until the Lost Prophet goes active... In a few hours, prison guards and staff are evacuated, the prisoners are left to die, and dark mysteries begin to surface. Only Flynn has the skills and knowledge to unravel them, but he will have to rely on the most unlikely of allies--killers, assassins, pirates and smugglers. If they can survive each other they just might survive the Razor...and claim it for their own. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9780765387943",
		"isbn10": "0765387948"
	},
	{
		"title": "By Fire Above (Signal Airship, Bk. 2)",
		"author": "Bennis, Robyn",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.09,
		"rating": 4.5,
		"description": "By Fire Above is the rip-roaring new adventure in Robyn Bennis's Signal Airship military fantasy series that Patricia Briggs hails as “full of sass and terrific characters.” \"All's fair in love and war,\" according to airship captain Josette Dupre, until her hometown of Durum becomes occupied by the enemy and her mother a prisoner of war. Then it becomes, \"Nothing's fair except bombing those Vins to high hell.\" Before she can rescue her town, however, Josette must maneuver her way through the nest of overstuffed vipers that make up Garnia's military and royal leaders in order to drum up support. The foppish and mostly tolerated Mistral crew member Lord Bernat steps in to advise her, along with his very attractive older brother. Between noble scheming, under-trained recruits, and supply shortages, Josette and the crew of the Mistral figure out a way to return to Durum—only to discover that when the homefront turns into the frontlines, things are more dangerous than they seem. “Full of sass and terrific characters. Great storytelling. Loved it.” —Patricia Briggs “Marvelous, witty and action-packed steampunk with exquisite attention to detail. Bennis's writing is incredible, her vocabulary impressive, and she honest to God made me believe you could build an airship from spare parts.”—New York Times and USA Today Bestselling author Ann Aguirre At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9780765388803",
		"isbn10": "0765388804"
	},
	{
		"title": "Guardian (Steeplejack Series, Bk. 3)",
		"author": "Hartley, A. J.",
		"format": "(Hardcover)",
		"listPrice": 26.99,
		"salePrice": null,
		"rating": 4.5,
		"description": "In A. J. Hartley’s thrilling and intriguing 19th-century South African-inspired fantasy world, which started with the Thriller Award-winning Steeplejack and continues with Guardian, Anglet Sutonga is a teenage detective fighting in a race against time as her beloved city is pushed to the brink. This is what Ang knows: A dear friend is accused of murdering the Prime Minister of Bar-Selehm. A mysterious but fatal illness is infecting the poor. A fanatical politician seizes power, unleashing a wave of violent repression over the city. This is what Ang must do: Protect her family. Solve a murder. RESIST, no matter what, before it’s too late. “Richly-drawn and diverse cast of characters, with an unstoppable plot!” —Carrie Ryan, New York Times bestselling author “Smart political intrigue wrapped in all the twists and turns of a good detective story.” — Kirkus Reviews,starred review “A political, multilayered mystery-thriller with a strong, impressively fierce heroine.” —Shelf Awareness, starred review At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9780765388179",
		"isbn10": "0765388170"
	},
	{
		"title": "Winter of Ice and Iron",
		"author": "Neumeier, Rachel",
		"format": "(Hardcover)",
		"listPrice": 40.99,
		"salePrice": 4.49,
		"rating": 5,
		"description": "In this gorgeous, dark fantasy in the spirit of Jacqueline Carey, a princess and a duke must protect the people of their nations when a terrible threat leaves everyone in danger. With the Mad King of Emmer in the north and the vicious King of Pohorir in the east, Kehara Raehema knows her country is in a vulnerable position. She never expected to give up everything she loves to save her people, but when the Mad King’s fury leaves her land in danger, she has no choice but to try any stratagem that might buy time for her people to prepare for war—no matter the personal cost. Hundreds of miles away, the pitiless Wolf Duke of Pohorir, Innisth Eanete, dreams of breaking his people and his province free of the king he despises. But he has no way to make that happen—until chance unexpectedly leaves Kehara on his doorstep and at his mercy. Yet in a land where immanent spirits inhabit the earth, political disaster is not the greatest peril one can face. Now, as the year rushes toward the dangerous midwinter, Kehera and Innisth find themselves unwilling allies, and their joined strength is all that stands between the peoples of the Four Kingdoms and utter catastrophe.",
		"isbn13": "9781481448994",
		"isbn10": "1481448994"
	},
	{
		"title": "Halls of Law (Faraman Prophecy, Bk. 1)",
		"author": "Escalada, V. M.",
		"format": "(Hardcover)",
		"listPrice": 35.99,
		"salePrice": 3.9,
		"rating": 5,
		"description": "The Faraman Polity was created by the first Luqs, and has been ruled for generations by those of the Luqs bloodline. It is a burgeoning empire maintained by the combined efforts of the standing military force and the Talents of the Halls of Law. While the military preserves and protects, it is the Halls’ Talents—those gifted from birth with magical abilities—who serve as the agents and judges of the Law. For no one can successfully lie to a Talent. Not only can they read people by the briefest of physical contacts, but they can also read objects, able to find information about anyone who has ever come into direct contact with that object. Thanks to the Talents and the career military, the Polity has long remained a stable and successful society. But all that is about to change. Seventeen-year-old Kerida Nast has always wanted a career in the military, just like the rest of her family. So when her Talent is discovered, and she knows she'll have to spend the rest of her life as a psychic for the Halls of Law, Ker isn't happy about it. Anyone entering the Halls must give up all personal connection with the outside world, losing their family and friends permanently. Just as Kerida is beginning to reconcile herself to her new role, the Polity is invaded by strangers from Halia, who begin a systematic campaign of destruction against the Halls, killing every last Talent they can find. Kerida manages to escape, falling in with Tel Cursar, a young soldier fleeing the battle, which saw the deaths of the royal family. Having no obvious heir to the throne, no new ruler to rally behind, the military leaders will be divided, unable to act quickly enough to save the empire. And with the Halls being burned to the ground, and the Talents slaughtered, the Rule of Law will be shattered. To avoid the invaders, Kerida and Tel are forced to enter old mining tunnels in a desperate attempt to carry word of the invaders to Halls and military posts that have not yet been attacked. But the tunnels hide a dangerous secret, a long-hidden colony of Feelers—paranormal outcasts shut away from the world for so long they are considered mythical. These traditional enemies of the Halls of Law welcome Kerida, believing she fulfills a Prophecy they were given centuries before by the lost race of griffins. With the help of these new allies, Kerida and Tel stand a chance of outdistancing the invaders and reaching their own troops. However, that is only the start of what will become a frantic mission to learn whether any heir to the throne remains, no matter how distant in the bloodline. Should they discover such a person, they will have to find the heir before the Halian invaders do. For if the Halians capture the future Luqs, it will spell the end of the Faraman Polity and the Rule of Law.",
		"isbn13": "9780756413347",
		"isbn10": "0756413346"
	}
]