[
	{
		"title": "Death Doesn't Bargain (Deadman's Cross, Bk. 2)",
		"author": "Kenyon, Sherrilyn",
		"format": "(Hardcover)",
		"listPrice": 37.99,
		"salePrice": 5.09,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9780765385710B/death-doesnt-bargain-deadmans-cross-bk-2",
		"rating": 5,
		"description": "Death Doesn’t Bargain is the second historical fantasy title in New York Times bestselling author Sherrilyn Kenyon’s Deadman’s Cross series. Where Deadmen tell their tales, and every soul is damned or redeemed by the final choices they make. The Deadmen are back... But so are the demons who have broken free of their eternal prison and are bent on mankind’s destruction. The worst of the lot is Vine, determined to claim their lives for taking hers. She will see the world burn...and has the perfect lure to destroy them all. One of their own. Kalder Dupree has never known a day of mercy. Born to the cruelest of mer-races, he sacrificed himself for his crew and is in Vine’s hands. He expects no mercy or rescue. Yet Cameron Jack is determined to set Kalder free. As a Hellchaser, it’s her calling, and she cannot allow even a not-so-innocent to be tortured for an act of kindness that spared her damnation. To defeat evil, it sometimes takes an even worse evil, and Cameron is willing to do whatever she must to make this right. If Vine thought she had her hands full before, she hasn’t seen anything nearly as powerful as Cameron’s resolve. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9780765385727",
		"isbn10": "0765385724"
	},
	{
		"title": "A Conspiracy of Truths",
		"author": "Rowland, Alexandra",
		"format": "(Hardcover)",
		"listPrice": 35.99,
		"salePrice": 2.96,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9781534412804B/a-conspiracy-of-truths",
		"rating": 4.5,
		"description": "A wrongfully imprisoned storyteller spins stories from his jail cell that just might have the power to save him—and take down a corrupt government. Arrested on accusations of witchcraft and treason, Chant finds himself trapped in a cold, filthy jail cell in a foreign land. With only his advocate, the unhelpful and uninterested Consanza, he quickly finds himself cast as a bargaining chip in a brewing battle between the five rulers of this small, backwards, and petty nation. Or, at least, that's how he would tell the story. In truth, Chant has little idea of what is happening outside the walls of his cell, but he must quickly start to unravel the puzzle of his imprisonment before they execute him for his alleged crimes. But Chant is no witch—he is a member of a rare and obscure order of wandering storytellers. With no country to call his home, and no people to claim as his own, all Chant has is his wits and his apprentice, a lad more interested in wooing handsome shepherds than learning the ways of the world. And yet, he has one great power: his stories in the ears of the rulers determined to prosecute him for betraying a nation he knows next to nothing about. The tales he tells will topple the Queens of Nuryevet and just maybe, save his life.",
		"isbn13": "9781534412811",
		"isbn10": "1534412816"
	},
	{
		"title": "Stygian (Dark-Hunter, Bk. 22)",
		"author": "Kenyon, Sherrilyn",
		"format": "(Hardcover)",
		"listPrice": 37.99,
		"salePrice": 5.73,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9781250102683B/stygian-dark-hunter-bk-22",
		"rating": 4.5,
		"description": "Born before man recorded time, I lived for thousands of years believing myself to be something I'm not. Someone I'm not. Lied to and betrayed by gods, Daimons and Dark-Hunters, I've struggled to find my way in a world where I've been cursed since the moment I was prematurely ripped from my mother and planted into the womb of an innocent woman who thought me her son. Trained as a slayer and predator, I learned to fit in and stay low. To become a tool for evil. Until I was sent to kill the one woman I couldn't. My hesitation cost her her life. Or so I thought. In an act of betrayal that makes all the others pale in comparison, I've learned that this world is an illusion and that my Phoebe still lives. Now I will have to travel into the very pits of Hades to try and save her, even as everyone around me attempts to steal what little soul I have left. There's only one person at my back and I'm not sure I can trust her either, for she was born of an enemy race. Yet sometimes the road to redemption is one that singes us to our very core. And if I fail to find the answers I need to save Phoebe, more than just my wife will die.",
		"isbn13": "1250312515",
		"isbn10": "9781250312518"
	},
	{
		"title": "Silver Silence (Psy-Changeling Trinity, Bk. 1)",
		"author": "Singh, Nalini",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 6.45,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9781101987797B/silver-silence-psy-changeling-trinity-bk-1",
		"rating": 4.5,
		"description": "New York Times bestselling author Nalini Singh returns to her extraordinary Psy-Changeling world with a story of wild passion and darkest betrayal... Control. Precision. Family. These are the principles that drive Silver Mercant. At a time when the fledgling Trinity Accord seeks to unite a divided world, with Silver playing a crucial role as director of a worldwide emergency response network, wildness and chaos are the last things she needs in her life. But that’s exactly what Valentin Nikolaev, alpha of the StoneWater bears, brings with him. Valentin has never met a more fascinating woman. Though Silver is ruled by Silence—her mind clear of all emotion—Valentin senses a whisper of fire around her. That’s what keeps him climbing apartment buildings to be near her. But when a shadow assassin almost succeeds in poisoning Silver, the stakes become deadly serious…and Silver finds herself in the heart of a powerful bear clan. Her would-be assassin has no idea what their poison has unleashed...",
		"isbn13": "9781101987810",
		"isbn10": "1101987812"
	},
	{
		"title": "Dark Legacy (A Carpathian Novel)",
		"author": "Feehan, Christine",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 7.38,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9780399583995B/dark-legacy-a-carpathian-novel",
		"rating": 5,
		"description": "In a thrilling Carpathian novel from #1 New York Times bestselling author Christine Feehan, a woman fights to free herself from the grip of the vampire trying to possess her... In a beautiful compound hidden away from the world, Emeline Sanchez tries to blunt the pain that has wracked her body ever since her terrifying ordeal in the labyrinth beneath the city—when she was forced to exchange blood with an evil master vampire. Now, it’s his voice that haunts her...that calls to her in the dark...that never lets her rest. And while the children that she helped to free from his clutches struggle to heal, watched over by their Carpathian protectors, Emeline knows one thing: She must sacrifice herself to keep them all from harm... For her beauty is irresistible to the vampires, her psychic ability like a drug. Whipped into a frenzy, they’ll never stop coming for her. And only the taste of one Carpathian warrior—the rush of his blood—can save her...",
		"isbn13": "9780399584008",
		"isbn10": "0399584005"
	},
	{
		"title": "Hollywood Dead: A Sandman Slim Novel",
		"author": "Kadrey, Richard",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.09,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9780062474179B/hollywood-dead-a-sandman-slim-novel",
		"rating": 5,
		"description": "Life and death takes on an entirely new meaning for half-angel, half-human hero James Stark, aka, Sandman Slim, in this insanely inventive, high-intensity tenth supernatural noir thriller in the New York Times bestselling series. James Stark is back from Hell, trailing more trouble in his wake. To return to L.A., he had to make a deal with the evil power brokers, Wormwood—an arrangement that came with a catch. While he may be home, Stark isn’t quite himself . . . because he’s only partially alive. There’s a time limit on his reanimated body, and unless Stark can find the people targeting Wormwood, he will die again—and this time there will be no coming back. Even though he’s armed with the Room of Thirteen Doors, Stark knows he can’t find Wormwood’s enemies alone. To succeed he’s got to enlist the help of new friends—plus a few unexpected old faces. Stark has been in dangerous situations before—you don’t get named Sandman Slim for nothing. But with a mysterious enemy on the loose, a debt to pay, and a clock ticking down, this may truly be the beginning of his end. . . .",
		"isbn13": "9780062474209",
		"isbn10": "0062474200"
	},
	{
		"title": "A Daughter of No Nation",
		"author": "Dellamonica, A. M.",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.73,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9780765334503B/a-daughter-of-no-nation",
		"rating": 4.5,
		"description": "As soon as Sophie Hansa returned to our world, she is anxious to once again go back to Stormwrack. Unable to discuss the wondrous sights she has seen, and unable to tell anyone what happened to her in her time away, Sophie is in a holding pattern, focused entirely on her eventual chance to return. With the sudden arrival of Garland Parrish, Sophie is once again gone. This time, she has been called back to Stormwrack in order to spend time with her father, a Duelist-Adjudicator, who is an unrivaled combatant and fearsome negotiator. But is he driven by his commitment to seeing justice prevail, or is he a sociopath? Soon, she discovers something repellent about him that makes her reject him, and everything he is offering. Adrift again, she discovers that her time spent with her father is not without advantages, however, for Sophie has discovered there is nothing to stop her from setting up a forensic institute in Stormwrack, investigating cases that have been bogged down in the courts, sometimes for years. Her fresh look into a long-standing case between two of the islands turns up new information that could get her, and her friends, pulled into something bold and daring, which changes the entire way she approaches this strange new world. . . . At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9781466812369",
		"isbn10": "1466812362"
	},
	{
		"title": "For the Killing of Kings (The Ring-Sworn Trilogy, Bk. 1)",
		"author": "Jones, Howard Andrew",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 5.09,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9781250006813B/for-the-killing-of-kings-the-ring-sworn-trilo",
		"rating": 5,
		"description": "Howard Andrew Jones' powerful world-building brings this epic fantasy to life in For The Killing of Kings, the first book of his new adventure-filled trilogy. Their peace was a fragile thing, but it had endured for seven years, mostly because the people of Darassus and the king of the Naor hordes believed his doom was foretold upon the edge of the great sword hung in the hall of champions. Unruly Naor clans might raid across the border, but the king himself would never lead his people to war so long as the blade remained in the hands of his enemies. But when squire Elenai’s aging mentor uncovers evidence that the sword in their hall is a forgery she’s forced to flee Darassus for her life, her only ally the reckless, disillusioned Kyrkenall the archer. Framed for murder and treason, pursued by the greatest heroes of the realm, they race to recover the real sword, only to stumble into a conspiracy that leads all the way back to the Darassan queen and her secretive advisors. They must find a way to clear their names and set things right, all while dodging friends determined to kill them – and the Naor hordes, invading at last with a new and deadly weapon.",
		"isbn13": "9781250022929",
		"isbn10": "1250022924"
	},
	{
		"title": "The Memory of Fire (The Waking Land)",
		"author": "Bates, Callie",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 6.96,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9780399177415B/the-memory-of-fire-the-waking-land",
		"rating": 5,
		"description": "Callie Bates’s debut novel, The Waking Land, announced the arrival of a brilliant new talent in epic fantasy. Now, with The Memory of Fire, Bates expertly deepens her tale, spinning glittering threads of magic and intrigue into a vibrant tapestry of adventure, betrayal, mystery, and romance. Thanks to the magic of Elanna Valtai and the Paladisan noble Jahan Korakides, the lands once controlled by the empire of Paladis have won their independence. But as Elanna exhausts her powers restoring the ravaged land, news that the emperor is readying an invasion spurs Jahan on a desperate mission to establish peace. Going back to Paladis proves to be anything but peaceful, however. As magic is a crime in the empire, punishable by death, Jahan must hide his abilities. Nonetheless, the grand inquisitor’s hunters suspect him of sorcery, and mysterious, urgent messages from the witch who secretly trained Jahan only increase his danger of exposure. Worst of all, the crown prince has turned his back on Jahan, robbing him of the royal protection he once enjoyed. As word of Jahan’s return spreads, long-sheathed knives, sharp and deadly, are drawn again. And when Elanna, stripped of her magic, is brought to the capital in chains, Jahan must face down the traumas of his past to defeat the shadowy enemies threatening his true love’s life, and the future of the revolution itself. Don’t miss any of Callie Bates’s magical Waking Land trilogy: THE WAKING LAND • THE MEMORY OF FIRE • THE SOUL OF POWER Praise for The Memory of Fire “Gripping . . . [this] vivid first-person, present-tense narrative [creates] a remarkably mature, balanced addition to the story that avoids the most common flaws of middle books and will leave readers hungry for the conclusion.”—Publishers Weekly (starred review) “[Callie] Bates does an excellent job of delving into Jahan’s past and showing his growth. . . . The relatable characters and riveting adventure make this fantasy world very accessible for all.”—Booklist “The Memory of Fire is a beautiful expansion of a promising story that delivers something rich and captivating. . . . Putting it down is likely to be the biggest challenge readers will encounter.”—Books, Vertigo & Tea",
		"isbn13": "9780399177422",
		"isbn10": "0399177426"
	},
	{
		"title": "Guardian (Steeplejack Series, Bk. 3)",
		"author": "Hartley, A. J.",
		"format": "(Hardcover)",
		"listPrice": 26.99,
		"salePrice": null,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9780765388155B/guardian-steeplejack-series-bk-3",
		"rating": 4.5,
		"description": "In A. J. Hartley’s thrilling and intriguing 19th-century South African-inspired fantasy world, which started with the Thriller Award-winning Steeplejack and continues with Guardian, Anglet Sutonga is a teenage detective fighting in a race against time as her beloved city is pushed to the brink. This is what Ang knows: A dear friend is accused of murdering the Prime Minister of Bar-Selehm. A mysterious but fatal illness is infecting the poor. A fanatical politician seizes power, unleashing a wave of violent repression over the city. This is what Ang must do: Protect her family. Solve a murder. RESIST, no matter what, before it’s too late. “Richly-drawn and diverse cast of characters, with an unstoppable plot!” —Carrie Ryan, New York Times bestselling author “Smart political intrigue wrapped in all the twists and turns of a good detective story.” — Kirkus Reviews,starred review “A political, multilayered mystery-thriller with a strong, impressively fierce heroine.” —Shelf Awareness, starred review At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9780765388179",
		"isbn10": "0765388170"
	},
	{
		"title": "Winter of Ice and Iron",
		"author": "Neumeier, Rachel",
		"format": "(Hardcover)",
		"listPrice": 40.99,
		"salePrice": 4.49,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9781481448970B/winter-of-ice-and-iron",
		"rating": 5,
		"description": "In this gorgeous, dark fantasy in the spirit of Jacqueline Carey, a princess and a duke must protect the people of their nations when a terrible threat leaves everyone in danger. With the Mad King of Emmer in the north and the vicious King of Pohorir in the east, Kehara Raehema knows her country is in a vulnerable position. She never expected to give up everything she loves to save her people, but when the Mad King’s fury leaves her land in danger, she has no choice but to try any stratagem that might buy time for her people to prepare for war—no matter the personal cost. Hundreds of miles away, the pitiless Wolf Duke of Pohorir, Innisth Eanete, dreams of breaking his people and his province free of the king he despises. But he has no way to make that happen—until chance unexpectedly leaves Kehara on his doorstep and at his mercy. Yet in a land where immanent spirits inhabit the earth, political disaster is not the greatest peril one can face. Now, as the year rushes toward the dangerous midwinter, Kehera and Innisth find themselves unwilling allies, and their joined strength is all that stands between the peoples of the Four Kingdoms and utter catastrophe.",
		"isbn13": "9781481448994",
		"isbn10": "1481448994"
	},
	{
		"title": "Halls of Law (Faraman Prophecy, Bk. 1)",
		"author": "Escalada, V. M.",
		"format": "(Hardcover)",
		"listPrice": 35.99,
		"salePrice": 3.9,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9780756409333B/halls-of-law-faraman-prophecy-bk-1",
		"rating": 5,
		"description": "The Faraman Polity was created by the first Luqs, and has been ruled for generations by those of the Luqs bloodline. It is a burgeoning empire maintained by the combined efforts of the standing military force and the Talents of the Halls of Law. While the military preserves and protects, it is the Halls’ Talents—those gifted from birth with magical abilities—who serve as the agents and judges of the Law. For no one can successfully lie to a Talent. Not only can they read people by the briefest of physical contacts, but they can also read objects, able to find information about anyone who has ever come into direct contact with that object. Thanks to the Talents and the career military, the Polity has long remained a stable and successful society. But all that is about to change. Seventeen-year-old Kerida Nast has always wanted a career in the military, just like the rest of her family. So when her Talent is discovered, and she knows she'll have to spend the rest of her life as a psychic for the Halls of Law, Ker isn't happy about it. Anyone entering the Halls must give up all personal connection with the outside world, losing their family and friends permanently. Just as Kerida is beginning to reconcile herself to her new role, the Polity is invaded by strangers from Halia, who begin a systematic campaign of destruction against the Halls, killing every last Talent they can find. Kerida manages to escape, falling in with Tel Cursar, a young soldier fleeing the battle, which saw the deaths of the royal family. Having no obvious heir to the throne, no new ruler to rally behind, the military leaders will be divided, unable to act quickly enough to save the empire. And with the Halls being burned to the ground, and the Talents slaughtered, the Rule of Law will be shattered. To avoid the invaders, Kerida and Tel are forced to enter old mining tunnels in a desperate attempt to carry word of the invaders to Halls and military posts that have not yet been attacked. But the tunnels hide a dangerous secret, a long-hidden colony of Feelers—paranormal outcasts shut away from the world for so long they are considered mythical. These traditional enemies of the Halls of Law welcome Kerida, believing she fulfills a Prophecy they were given centuries before by the lost race of griffins. With the help of these new allies, Kerida and Tel stand a chance of outdistancing the invaders and reaching their own troops. However, that is only the start of what will become a frantic mission to learn whether any heir to the throne remains, no matter how distant in the bloodline. Should they discover such a person, they will have to find the heir before the Halian invaders do. For if the Halians capture the future Luqs, it will spell the end of the Faraman Polity and the Rule of Law.",
		"isbn13": "9780756413347",
		"isbn10": "0756413346"
	},
	{
		"title": "Power Game (A Ghost Walker Novel)",
		"author": "Feehan, Christine",
		"format": "(Hardcover)",
		"listPrice": 36.99,
		"salePrice": 6.45,
		"url": "https://bookoutlet.cahttps://bookoutlet.ca/Store/Details/9780399587160B/power-game-a-ghost-walker-novel",
		"rating": 5,
		"description": "#1 New York Times bestselling author Christine Feehan is “one of the best storytellers around” (RT Book Reviews). Find out why as two lovers surrounded by greed and corruption discover there’s no telling whom you can trust—or who will come out on top... When members of a United Nations joint security force are taken hostage by radical terrorists in Indonesia, Captain Ezekiel Fortunes is called to lead the rescue team. Part of a classified government experiment, Zeke is a supersoldier with enhanced abilities. He can see better and run faster than the enemy, disappear when necessary and hunt along any terrain. There are those in the world willing to do anything for power like that... A formidable spy genetically engineered to hide in plain sight, Bellisia rarely meets a man who doesn’t want to control her or kill her. But Zeke is different. His gaze, his touch—they awaken feelings inside her that she never thought possible. He’s the kind of man she could settle down with—if she can keep him alive...",
		"isbn13": "9780399583926",
		"isbn10": "0399583920"
	}
]