[
	{
		"title": "Trail of Lightning (The Sixth World, Bk. 1)",
		"author": "Roanhorse, Rebecca",
		"format": "(Paperback)",
		"listPrice": 22.99,
		"salePrice": 8.66,
		"url": "https://bookoutlet.ca/Store/Details/9781534413504B/trail-of-lightning-the-sixth-world-bk-1",
		"rating": 4,
		"description": "2019 LOCUS AWARD WINNER, BEST FIRST NOVEL 2019 HUGO AWARD FINALIST, BEST NOVEL Nebula Award Finalist for Best Novel One of Bustle’s Top 20 “landmark sci-fi and fantasy novels” of the decade “Someone please cancel Supernatural already and give us at least five seasons of this badass Indigenous monster-hunter and her silver-tongued sidekick.” —The New York Times “An excitingly novel tale.” —Charlaine Harris, #1 New York Times bestselling author of the Sookie Stackhouse and Midnight Crossroads series “Fun, terrifying, hilarious, and brilliant.” —Daniel José Older, New York Times bestselling author of Shadowshaper and Star Wars: Last Shot “A powerful and fiercely personal journey through a compelling postapocalyptic landscape.” —Kate Elliott, New York Times bestselling author of Court of Fives and Black Wolves While most of the world has drowned beneath the sudden rising waters of a climate apocalypse, Dinétah (formerly the Navajo reservation) has been reborn. The gods and heroes of legend walk the land, but so do monsters—and it is up to one young woman to unravel the mysteries of the past before they destroy the future. Maggie Hoskie is a Dinétah monster hunter, a supernaturally gifted killer. When a small town needs help finding a missing girl, Maggie is their last best hope. But what Maggie uncovers about the monster is much more terrifying than anything she could imagine. Maggie reluctantly enlists the aid of Kai Arviso, an unconventional medicine man, and together they travel the rez, unraveling clues from ancient legends, trading favors with tricksters, and battling dark witchcraft in a patchwork world of deteriorating technology. As Maggie discovers the truth behind the killings, she will have to confront her past if she wants to survive. Welcome to the Sixth World.",
		"isbn13": "9781534413511",
		"isbn10": "1534413510"
	},
	{
		"title": "HALO: The Fall of Reach",
		"author": "Nylund, Eric",
		"format": "(Paperback)",
		"listPrice": 22.99,
		"salePrice": 6.96,
		"url": "https://bookoutlet.ca/Store/Details/9781982111618B/halo-the-fall-of-reach",
		"rating": 5,
		"description": "The New York Times bestselling origin story of the Master Chief—part of the expanded universe based on the award-winning video game series Halo! The twenty-sixth century. Humanity has expanded beyond Earth’s system to hundreds of planets that colonists now call home. But the United Earth Government and the United Nations Space Command is struggling to control this vast empire. After exhausting all strategies to keep seething colonial insurrections from exploding into a full-blown interplanetary civil war, the UNSC has one last hope. At the Office of Naval Intelligence, Dr. Catherine Halsey has been hard at work on a top-secret program that could bring an end to the conflict…and it starts with seventy-five children, among them a six-year-old boy named John. And Halsey could never guess that this child will eventually become the final hope against an even greater peril engulfing the galaxy—the inexorable confrontation with a theocratic military alliance of alien races known as the Covenant. This is the electrifying origin story of Spartan John-117—the Master Chief—and of his legendary, unstoppable heroism in leading the resistance against humanity’s possible extinction.",
		"isbn13": "9781982111625",
		"isbn10": "1982111623"
	},
	{
		"title": "The Flood (HALO, Bk. 2)",
		"author": "Dietz, William C.",
		"format": "(Paperback)",
		"listPrice": 22.99,
		"salePrice": 6.79,
		"url": "https://bookoutlet.ca/Store/Details/9781982111632B/the-flood-halo-bk-2",
		"rating": 3.5,
		"description": "Fleeing the destruction of the planet Reach, the Master Chief and a few human survivors crash-land on Halo, where they race to unravel its secrets in order to gain control of a great source of power before the alien occupiers do.",
		"isbn13": "9780345459213",
		"isbn10": "0345459210"
	},
	{
		"title": "The Final Day (John Matherson Series, Bk. 3)",
		"author": "Forstchen, William R.",
		"format": "(Pocket Books)",
		"listPrice": 13.99,
		"salePrice": 4.66,
		"url": "https://bookoutlet.ca/Store/Details/9780765376756B/the-final-day-john-matherson-series-bk-3",
		"rating": 3.5,
		"description": "A major release in the New York Times bestselling One Second After series, set in an alternate America rebuilding after an electromagnetic pulse, this is William R. Forstchen's The Final Day. Since the detonation of nuclear weapons above the United States more than two years ago, the small town of Black Mountain, North Carolina has suffered famine, civil war, and countless deaths. Now, after defeating a new, tyrannical federal government, John Matherson and his community intend to restore their world to what it was before the EMP apocalypse. For the most part, they are succeeding. This period of relative stability doesn’t last long. A new, aggressive government announces that it’s taking over and ceding large portions of the country to China and Mexico. The Constitution is no longer in effect, and what’s left of the U.S. Army has been deployed to suppress rebellion in the remaining states. John fears he and his town will be targets. General Bob Scales, John’s old commanding officer and closest friend from prewar days, is sent to bring John into line. Will John and his people accept the new, autocratic regime? Or will revolution rip the fledgling nation apart at the seams? Months before publication, William R. Forstchen’s novel One Second After was cited on the floor of Congress as a book all Americans should read. This third book in the series immerses readers once more in the story of our nation’s struggle to rebuild itself after an electromagnetic pulse wipes out all electricity and plunges the country into darkness, starvation, and death. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9781466851900",
		"isbn10": "1466851902"
	},
	{
		"title": "Shadow & Claw (The Bood of the New Sun)",
		"author": "Wolfe, Gene",
		"format": "(Paperback)",
		"listPrice": 24.99,
		"salePrice": 9.51,
		"url": "https://bookoutlet.ca/Store/Details/9780312890179B/shadow-claw-the-bood-of-the-new-sun",
		"rating": 5,
		"description": "The Shadow Lines Is A Highly Innovative, Complex And Celebrated Novel Of Amitav Ghosh. Published In 1988, It Received The Prestigious Sahitya Academy Award In The Following Year. Not Only Literary Critics But Also Some Noted Litterateurs Have Acclaimed It For What It Has Been Able To Achieve As A Work Of Art. Its Focus Is A Fact Of History, The Post-Partition Scenario Of Violence; But Its Overall Form Is A Subtle Interweaving Of Fact, Fiction And Reminiscence.It Is A Novel In Which Amitav Ghosh Has Been Able To Realise His Artistic Conception Through An Art Form, Which Is Cohesive. However, It Remains Somewhat Inaccessible To Some Readers; They Are, Particularly, Mystified By Its Non-Linear Mode. This Volume Of Critical Essays On The Shadow Lines Is Being Presented In The Hope That It Will Enable The Reader To Gain An Insight Into The Meaning And Structure Of The Novel. In The First Part Of The Book, The Contributors Bring Out The Various Aspects/Elements Of The Novel. The Second Part Has Essays, Which Look At The Novel From Some Current Critical Perspectives Feminist, Post-Colonial And Historicist But The Emphasis Of These Essays Is Upon Practice And Not Theory. The Idea Is That The Reader Learns About A Specific Approach By Seeing It Applied To The The Shadow Lines. The Third Part Has A Single But Significant Essay The Shadow Lines In Context Which Relates The Novel To Ghosh S Other Works, Both Fiction And Non-Fiction. Though The Book Is Primarily Addressed To The Student, It Is Hoped That It Will Interest The Common Discernible Reader As Well.",
		"isbn13": "8126901950",
		"isbn10": "9788126901951"
	},
	{
		"title": "Seveneves",
		"author": "Stephenson, Neal",
		"format": "(Paperback)",
		"listPrice": 24.99,
		"salePrice": 6.96,
		"url": "https://bookoutlet.ca/Store/Details/9780062334510B/seveneves",
		"rating": 3.5,
		"isbn13": "0062334514",
		"isbn10": "9780062334510"
	},
	{
		"title": "Ender's Game (The Ender Quintet, Bk. 1)",
		"author": "Card, Orson Scott",
		"format": "(Hardcover)",
		"listPrice": 20.99,
		"salePrice": 6.19,
		"url": "https://bookoutlet.ca/Store/Details/9780765394866B/enders-game-the-ender-quintet-bk-1",
		"rating": 4.5,
		"description": "Winner of the Hugo and Nebula Awards In order to develop a secure defense against a hostile alien race's next attack, government agencies breed child geniuses and train them as soldiers. A brilliant young boy, Andrew \"Ender\" Wiggin lives with his kind but distant parents, his sadistic brother Peter, and the person he loves more than anyone else, his sister Valentine. Peter and Valentine were candidates for the soldier-training program but didn't make the cut—young Ender is the Wiggin drafted to the orbiting Battle School for rigorous military training. Ender's skills make him a leader in school and respected in the Battle Room, where children play at mock battles in zero gravity. Yet growing up in an artificial community of young soldiers Ender suffers greatly from isolation, rivalry from his peers, pressure from the adult teachers, and an unsettling fear of the alien invaders. His psychological battles include loneliness, fear that he is becoming like the cruel brother he remembers, and fanning the flames of devotion to his beloved sister. Is Ender the general Earth needs? But Ender is not the only result of the genetic experiments. The war with the Buggers has been raging for a hundred years, and the quest for the perfect general has been underway for almost as long. Ender's two older siblings are every bit as unusual as he is, but in very different ways. Between the three of them lie the abilities to remake a world. If, that is, the world survives. Ender's Game is the winner of the 1985 Nebula Award for Best Novel and the 1986 Hugo Award for Best Novel. THE ENDER UNIVERSE Ender series Ender’s Game / Ender in Exile / Speaker for the Dead / Xenocide / Children of the Mind Ender’s Shadow series Ender’s Shadow / Shadow of the Hegemon / Shadow Puppets / Shadow of the Giant / Shadows in Flight Children of the Fleet The First Formic War (with Aaron Johnston) Earth Unaware / Earth Afire / Earth Awakens The Second Formic War (with Aaron Johnston) The Swarm /The Hive Ender novellas A War of Gifts /First Meetings At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
		"isbn13": "9781429963930",
		"isbn10": "142996393X"
	},
	{
		"title": "The Forever War",
		"author": "Haldeman, Joe",
		"format": "(Paperback)",
		"listPrice": 20.99,
		"salePrice": 8.28,
		"url": "https://bookoutlet.ca/Store/Details/9780312536633B/the-forever-war",
		"rating": 3.5,
		"description": "Drafted into the ranks of Earth's interstellar warriors, private William Mandella finds his fight against the Taurans secondary to the side-effects of faster-than-light space travel, which affects the rate at which he ages. Winner of the Hugo and Nebula Awards. Reprint. 25,000 first printing.",
		"isbn13": "0060510862",
		"isbn10": "9780060510862"
	}
]